[
  {
    "image_name": "Attempt1",
    "image_path": "data/sample_images/attempts/Attempt1.jpeg",
    "success": true,
    "analysis": {
      "image_analysis": "The image contains handwritten mathematical content, including definitions, equations, and calculations related to probability.",
      "content_type": "Probability problem involving conditional probabilities and events.",
      "solution_area_description": "The handwritten content is centered in the image, with text and equations spanning from the top to the middle of the image. The work is aligned to the left, with some space on the right and bottom.",
      "complete_solution_bounding_box": {
        "minX": 0.1,
        "maxX": 0.9,
        "minY": 0.1,
        "maxY": 0.6
      },
      "confidence": "high",
      "notes": "The solution area is well-defined and does not extend to the edges of the image, leaving clear margins."
    }
  },
  {
    "image_name": "Attempt2",
    "image_path": "data/sample_images/attempts/Attempt2.jpeg",
    "success": true,
    "analysis": {
      "image_analysis": "The image contains a handwritten mathematical solution involving trigonometry, specifically using the tangent function to solve for a height.",
      "content_type": "Trigonometry problem involving tangent function",
      "solution_area_description": "The handwritten content is centered in the image, with equations and text spanning multiple lines. The work includes mathematical notation and calculations.",
      "complete_solution_bounding_box": {
        "minX": 0.2,
        "maxX": 0.7,
        "minY": 0.1,
        "maxY": 0.6
      },
      "confidence": "high",
      "notes": "The solution involves calculating height using the tangent of an angle, with clear steps shown in the work."
    }
  },
  {
    "image_name": "Attempt3",
    "image_path": "data/sample_images/attempts/Attempt3.jpeg",
    "success": true,
    "analysis": {
      "image_analysis": "The image contains a handwritten mathematical solution involving solving an equation. The work includes several steps of algebraic manipulation.",
      "content_type": "Algebraic equation solving",
      "solution_area_description": "The handwritten work is centered in the upper half of the image, with equations and calculations spread vertically. The work is aligned to the left, with the right side having more space.",
      "complete_solution_bounding_box": {
        "minX": 0.1,
        "maxX": 0.6,
        "minY": 0.1,
        "maxY": 0.5
      },
      "confidence": "high",
      "notes": "The solution area is well-defined with clear boundaries, capturing all handwritten content without excess blank space."
    }
  },
  {
    "image_name": "Attempt4",
    "image_path": "data/sample_images/attempts/Attempt4.jpeg",
    "success": true,
    "analysis": {
      "image_analysis": "The image contains a handwritten mathematical solution with three main steps. It includes equations, calculations, and text annotations.",
      "content_type": "Complex number algebra problem involving expansion and substitution.",
      "solution_area_description": "The handwritten work spans from the top left to the bottom right of the image, capturing all steps and calculations.",
      "complete_solution_bounding_box": {
        "minX": 0.05,
        "maxX": 0.95,
        "minY": 0.05,
        "maxY": 0.9
      },
      "confidence": "high",
      "notes": "The solution area includes all relevant mathematical expressions and annotations, ensuring no part of the student's work is excluded."
    }
  }
]